MOVE SPACES TO WS-CUSTOMER-NAME.

IF WS-CUSTOMER-ID > 99999 OR WS-CUSTOMER-ID < 0 
  DISPLAY "Invalid Customer ID" 
ELSE
  READ CUSTOMER-FILE 
     KEY IS WS-CUSTOMER-ID
     INVALID KEY DISPLAY "Customer not found" 
     NOT INVALID KEY MOVE CUSTOMER-NAME FROM CUSTOMER-RECORD
END-IF.

IF CUSTOMER-FILE-STATUS = 35
  DISPLAY "Customer file is empty"
END-IF.